{"modelTopology": {"training_config": {"metrics": ["mse", "mae"], "loss": "mean_squared_error", "optimizer_config": {"class_name": "SGD", "config": {"nesterov": true, "lr": 9.999999747378752e-05, "momentum": 0.8999999761581421, "decay": 9.999999974752427e-07}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.2", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 100, 100, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_pool", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"name": "block2_pool", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"name": "block3_pool", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"name": "block4_pool", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"name": "block5_pool", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block5_pool"}, {"class_name": "Sequential", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": [{"class_name": "Flatten", "config": {"dtype": "float32", "batch_input_shape": [null, 3, 3, 512], "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "batch_input_shape": [null, [100, 100, 3]], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["sequential_1", 1, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of21", "group1-shard2of21", "group1-shard3of21", "group1-shard4of21", "group1-shard5of21", "group1-shard6of21", "group1-shard7of21", "group1-shard8of21", "group1-shard9of21", "group1-shard10of21", "group1-shard11of21", "group1-shard12of21", "group1-shard13of21", "group1-shard14of21", "group1-shard15of21", "group1-shard16of21", "group1-shard17of21", "group1-shard18of21", "group1-shard19of21", "group1-shard20of21", "group1-shard21of21"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "block1_conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "block1_conv2/kernel"}, {"dtype": "float32", "shape": [64], "name": "block1_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "block2_conv1/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "block2_conv2/kernel"}, {"dtype": "float32", "shape": [128], "name": "block2_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "block3_conv1/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv2/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv3/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv4/kernel"}, {"dtype": "float32", "shape": [256], "name": "block3_conv4/bias"}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "block4_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv4/kernel"}, {"dtype": "float32", "shape": [512], "name": "block4_conv4/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv1/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv1/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv2/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv2/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv3/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv3/bias"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv4/kernel"}, {"dtype": "float32", "shape": [512], "name": "block5_conv4/bias"}, {"dtype": "float32", "shape": [4608, 256], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [256], "name": "dense_1/bias"}, {"dtype": "float32", "shape": [256, 1], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_2/bias"}]}]}